In [1]:
import pandas as pd 
import numpy as np

In [27]:
1)
ch=['anand','roy','sam']
for i in ch :
    #print(i,':',len(i))
    p={i:len(i)}
    
    print(p)

{'anand': 5}
{'roy': 3}
{'sam': 3}

In [60]:
s=[23,34,5,4,45,324,234,32,3,55]
temp=0

for i in s:
    i=temp
    temp=i+temp
    print(temp)

0
0
0
0
0
0
0
0
0
0

In [40]:
#4
df=pd.DataFrame({
    'city':["pune",'mumbai','nashik'],
    'avg_age':[27,30,28]
})

In [42]:
df

     city  avg_age
0    pune       27
1  mumbai       30
2  nashik       28

In [ ]:
#2)
ch1="bed"

for i in ch1 :
    if i==ch1

In [62]:
data=pd.DataFrame({
    "name":["a","b","c","d","e","f"],
     'city':["pune",'mumbai','nashik',"pune",'mumbai','pune'],
    'avg_age':[27,30,28,45,32,20]
})

In [64]:
data

  name    city  avg_age
0    a    pune       27
1    b  mumbai       30
2    c  nashik       28
3    d    pune       45
4    e  mumbai       32
5    f    pune       20

In [66]:
#5)
data.groupby('city')['avg_age'].mean()

city
mumbai    31.000000
nashik    28.000000
pune      30.666667
Name: avg_age, dtype: float64

In [82]:
data[[data['avg_age']>30 and data['avg_age']<40]].value_counts()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [108]:
data["avg_age"]=data["avg_age"].apply(lambda i = i+2  )

SyntaxError: invalid syntax (1943875718.py, line 1)

In [ ]:
data['category']=data

In [104]:
#8)
#df.pivot(index='city',columns="avg_age",values=['city','avg_age'])
df.pivot(columns="avg_age")

         city
avg_age    27      28      30
0        pune     NaN     NaN
1         NaN     NaN  mumbai
2         NaN  nashik     NaN

In [78]:
#10)
data['city']=data['avg_age'].rank()
data['city']

0    2.0
1    4.0
2    3.0
3    6.0
4    5.0
5    1.0
Name: city, dtype: float64

In [80]:
data.rank()

   name  city  avg_age
0   1.0   2.0      2.0
1   2.0   4.0      4.0
2   3.0   3.0      3.0
3   4.0   6.0      6.0
4   5.0   5.0      5.0
5   6.0   1.0      1.0